logs/scenario-s-logs/dataplane-probe-queue.log
{"level":"info","ts":1692774196.1218197,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/08/23 07:03:16 Starting dataplane probe for target: queue
Requests      [total, rate, throughput]         180000, 1000.00, 999.44
Duration      [total, attack, wait]             3m0s, 3m0s, 101.463ms
Latencies     [min, mean, 50, 90, 95, 99, max]  100.518ms, 102.069ms, 101.597ms, 102.22ms, 102.467ms, 104.627ms, 533.939ms
Bytes In      [total, mean]                     4300100, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:180000  
Error Set:
2023/08/23 07:06:16 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
2023/08/23 07:06:16 Dataplane probe test finished
2023/08/23 07:06:16 Shutting down InfluxReporter