logs/scenario-s-logs/load-test-200.log
{"level":"info","ts":1692775762.8549478,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/08/23 07:29:23 Starting the load test.
2023/08/23 07:30:27 All pods are done (scaled to zero) or terminating after 1m2.001074002s
Requests      [total, rate, throughput]         720000, 2000.00, 1999.43
Duration      [total, attack, wait]             6m0s, 6m0s, 102.57ms
Latencies     [min, mean, 50, 90, 95, 99, max]  100.515ms, 110.127ms, 102.208ms, 103.062ms, 103.346ms, 115.454ms, 3.376s
Bytes In      [total, mean]                     17200088, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:720000  
Error Set:
2023/08/23 07:36:27 SLA 1 passed. P95 latency is in 100-115ms time range
2023/08/23 07:36:27 SLA 2 passed. Max latency is below 10s
2023/08/23 07:36:27 SLA 3 passed. No errors occurred
2023/08/23 07:36:27 Load test finished
2023/08/23 07:36:27 Shutting down InfluxReporter