logs/scenario-s-logs/rollout-probe-activator.log
{"level":"info","ts":1693207803.7932448,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/08/28 07:30:04 Running rollout probe test with selector: serving.knative.dev/service=activator-with-cc
2023/08/28 07:30:05 Inferred first revision = activator-with-cc-00001
2023/08/28 07:30:34 Updating the service: activator-with-cc
2023/08/28 07:30:34 Successfully updated the service.
Requests      [total, rate, throughput]         648000, 3600.02, 3407.04
Duration      [total, attack, wait]             3m0s, 3m0s, 104.341ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.502ms, 141.067ms, 104.575ms, 114.03ms, 130.496ms, 760.325ms, 10.904s
Bytes In      [total, mean]                     21807000, 33.65
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           94.69%
Status Codes  [code:count]                      200:613620  503:34380
Error Set:
503 Service Unavailable
2023/08/28 07:33:04 Shutting down InfluxReporter
2023/08/28 07:33:04 SLA 1 failed. P95 latency is not in 100-110ms time range: 130.495715ms